## Terraform data for `apps` stack
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Show Validation</summary>

```
Success! The configuration is valid.


```
</details>

#### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>

```
module.s42.random_password.postgres: Refreshing state... [id=none]
module.webhooked.module.webhooked.kubernetes_config_map.app["config"]: Refreshing state... [id=production/webhooked-config]
module.s42.kubernetes_config_map.stud42_config: Refreshing state... [id=production/stud42-config]
module.s42.random_password.next_auth_secret: Refreshing state... [id=none]
module.s42.random_password.meilisearch_token: Refreshing state... [id=none]
module.webhooked.module.webhooked.kubernetes_service.app[0]: Refreshing state... [id=production/webhooked]
module.s42.module.istio.kubectl_manifest.virtual_services["app-s42"]: Refreshing state... [id=/apis/networking.istio.io/v1alpha3/namespaces/production/virtualservices/app-s42]
module.s42.module.postgres.kubernetes_config_map.app["config"]: Refreshing state... [id=production/postgres-config]
module.s42.module.postgres.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=production/postgres-data]
module.s42.module.postgres.kubernetes_service.app[0]: Refreshing state... [id=production/postgres]
module.s42.module.interface.kubernetes_service.app[0]: Refreshing state... [id=production/interface]
module.s42.module.api.kubernetes_service.app[0]: Refreshing state... [id=production/api]
module.s42.kubernetes_secret.next_auth_secret: Refreshing state... [id=production/next-auth-secret]
module.s42.module.meilisearch.kubernetes_service.app[0]: Refreshing state... [id=production/meilisearch]
module.s42.module.meilisearch.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=production/meilisearch-data]
module.webhooked.module.secrets.kubernetes_manifest.sealed_secret["s42-webhooked-secrets"]: Refreshing state...
module.s42.module.crawler_campus.kubernetes_cron_job.app[0]: Refreshing state... [id=production/crawler-campus]
module.s42.module.api.kubernetes_deployment.app[0]: Refreshing state... [id=production/api]
module.s42.module.interface.kubernetes_deployment.app[0]: Refreshing state... [id=production/interface]
module.s42.module.crawler_locations.kubernetes_cron_job.app[0]: Refreshing state... [id=production/crawler-locations]
module.s42.module.jwtks_service.kubernetes_deployment.app[0]: Refreshing state... [id=production/jwtks-service]
module.s42.module.jwtks_service.kubernetes_service.app[0]: Refreshing state... [id=production/jwtks-service]
module.s42.kubernetes_manifest.rabbitmq: Refreshing state...
module.s42.module.webhooks_processor.kubernetes_deployment.app[0]: Refreshing state... [id=production/webhooks-processor]
module.s42.module.meilisearch_clean_tasks.kubernetes_cron_job.app[0]: Refreshing state... [id=production/meilisearch-clean-tasks]
module.s42.module.meilisearch.kubernetes_secret.app["token"]: Refreshing state... [id=production/meilisearch-token]
module.s42.module.postgres.kubernetes_secret.app["credentials"]: Refreshing state... [id=production/postgres-credentials]
module.s42.module.postgres.kubernetes_stateful_set.app[0]: Refreshing state... [id=production/postgres]
module.s42.module.service-token.kubernetes_manifest.sealed_secret["oauth2-providers"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["sentry-dsns"]: Refreshing state...
module.s42.module.meilisearch.kubernetes_stateful_set.app[0]: Refreshing state... [id=production/meilisearch]
module.s42.module.service-token.kubernetes_manifest.sealed_secret["jwtks-service-certs-jwk"]: Refreshing state...
module.s42.module.api.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/api]
module.s42.module.interface.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/interface]
module.s42.module.jwtks_service.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/jwtks-service]
module.s42.module.webhooks_processor.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/webhooks-processor]
module.webhooked.module.webhooked.kubernetes_deployment.app[0]: Refreshing state... [id=production/webhooked]
module.s42.module.service-token.kubernetes_manifest.sealed_secret["s42-service-token"]: Refreshing state...
module.webhooked.module.webhooked.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/webhooked]
module.s42.kubernetes_pod_disruption_budget.rabbitmq: Refreshing state... [id=production/rabbitmq]
module.s42.module.jwtks_service.kubernetes_manifest.certificate["grpc-internal"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["github-token"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["discord-token"]: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.s42.kubernetes_manifest.rabbitmq will be updated in-place
  ~ resource "kubernetes_manifest" "rabbitmq" {
      ~ manifest = {
          ~ spec       = {
              ~ rabbitmq         = {
                  ~ additionalPlugins = [
                        # (2 unchanged elements hidden)
                        "rabbitmq_tracing",
                      + "rabbitmq_shovel",
                      + "rabbitmq_shovel_management",
                    ]
                }
                # (6 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ rabbitmq                      = {
                  ~ additionalPlugins = [
                        # (2 unchanged elements hidden)
                        "rabbitmq_tracing",
                      + "rabbitmq_shovel",
                      + "rabbitmq_shovel_management",
                    ]
                    # (3 unchanged elements hidden)
                }
                # (13 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.kubernetes_manifest.rabbitmq_binding_webhooks_dlq will be created
  + resource "kubernetes_manifest" "rabbitmq_binding_webhooks_dlq" {
      + manifest = {
          + apiVersion = "rabbitmq.com/v1beta1"
          + kind       = "Binding"
          + metadata   = {
              + name      = "webhooks.dlq"
              + namespace = "production"
            }
          + spec       = {
              + destination              = "webhooks.dlq"
              + destinationType          = "queue"
              + rabbitmqClusterReference = {
                  + name = "rabbitmq"
                }
              + routingKey               = "webhooks.dlq"
              + source                   = "webhooks"
            }
        }
      + object   = {
          + apiVersion = "rabbitmq.com/v1beta1"
          + kind       = "Binding"
          + metadata   = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "webhooks.dlq"
              + namespace                  = "production"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + arguments                = (known after apply)
              + destination              = "webhooks.dlq"
              + destinationType          = "queue"
              + rabbitmqClusterReference = {
                  + connectionSecret = {
                      + name = (known after apply)
                    }
                  + name             = "rabbitmq"
                  + namespace        = (known after apply)
                }
              + routingKey               = "webhooks.dlq"
              + source                   = "webhooks"
              + vhost                    = (known after apply)
            }
        }
    }

  # module.s42.kubernetes_manifest.rabbitmq_exchange_webhooks will be created
  + resource "kubernetes_manifest" "rabbitmq_exchange_webhooks" {
      + manifest = {
          + apiVersion = "rabbitmq.com/v1beta1"
          + kind       = "Exchange"
          + metadata   = {
              + name      = "webhooks"
              + namespace = "production"
            }
          + spec       = {
              + autoDelete               = false
              + durable                  = true
              + name                     = "webhooks"
              + rabbitmqClusterReference = {
                  + name = "rabbitmq"
                }
              + type                     = "direct"
            }
        }
      + object   = {
          + apiVersion = "rabbitmq.com/v1beta1"
          + kind       = "Exchange"
          + metadata   = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "webhooks"
              + namespace                  = "production"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + arguments                = (known after apply)
              + autoDelete               = false
              + durable                  = true
              + name                     = "webhooks"
              + rabbitmqClusterReference = {
                  + connectionSecret = {
                      + name = (known after apply)
                    }
                  + name             = "rabbitmq"
                  + namespace        = (known after apply)
                }
              + type                     = "direct"
              + vhost                    = (known after apply)
            }
        }
    }

  # module.s42.kubernetes_manifest.rabbitmq_policy_webhooks_dlq will be created
  + resource "kubernetes_manifest" "rabbitmq_policy_webhooks_dlq" {
      + manifest = {
          + apiVersion = "rabbitmq.com/v1beta1"
          + kind       = "Policy"
          + metadata   = {
              + name      = "webhooks.dlq"
              + namespace = "production"
            }
          + spec       = {
              + applyTo                  = "queues"
              + definition               = {
                  + dead-letter-exchange    = "webhooks"
                  + dead-letter-routing-key = "webhooks.dlq"
                }
              + name                     = "webhooks.dlq"
              + pattern                  = "webhooks.processing"
              + rabbitmqClusterReference = {
                  + name = "rabbitmq"
                }
            }
        }
      + object   = {
          + apiVersion = "rabbitmq.com/v1beta1"
          + kind       = "Policy"
          + metadata   = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "webhooks.dlq"
              + namespace                  = "production"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + applyTo                  = "queues"
              + definition               = {
                  + dead-letter-exchange    = "webhooks"
                  + dead-letter-routing-key = "webhooks.dlq"
                }
              + name                     = "webhooks.dlq"
              + pattern                  = "webhooks.processing"
              + priority                 = (known after apply)
              + rabbitmqClusterReference = {
                  + connectionSecret = {
                      + name = (known after apply)
                    }
                  + name             = "rabbitmq"
                  + namespace        = (known after apply)
                }
              + vhost                    = (known after apply)
            }
        }
    }

  # module.s42.kubernetes_manifest.rabbitmq_queue_webhooks_dlq will be created
  + resource "kubernetes_manifest" "rabbitmq_queue_webhooks_dlq" {
      + manifest = {
          + apiVersion = "rabbitmq.com/v1beta1"
          + kind       = "Queue"
          + metadata   = {
              + name      = "webhooks.dlq"
              + namespace = "production"
            }
          + spec       = {
              + autoDelete               = false
              + durable                  = true
              + name                     = "webhooks.dlq"
              + rabbitmqClusterReference = {
                  + name = "rabbitmq"
                }
            }
        }
      + object   = {
          + apiVersion = "rabbitmq.com/v1beta1"
          + kind       = "Queue"
          + metadata   = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "webhooks.dlq"
              + namespace                  = "production"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + arguments                = (known after apply)
              + autoDelete               = false
              + durable                  = true
              + name                     = "webhooks.dlq"
              + rabbitmqClusterReference = {
                  + connectionSecret = {
                      + name = (known after apply)
                    }
                  + name             = "rabbitmq"
                  + namespace        = (known after apply)
                }
              + type                     = (known after apply)
              + vhost                    = (known after apply)
            }
        }
    }

  # module.s42.kubernetes_manifest.rabbitmq_queue_webhooks_processing will be created
  + resource "kubernetes_manifest" "rabbitmq_queue_webhooks_processing" {
      + manifest = {
          + apiVersion = "rabbitmq.com/v1beta1"
          + kind       = "Queue"
          + metadata   = {
              + name      = "webhooks.processing"
              + namespace = "production"
            }
          + spec       = {
              + autoDelete               = false
              + durable                  = true
              + name                     = "webhooks.processing"
              + rabbitmqClusterReference = {
                  + name = "rabbitmq"
                }
            }
        }
      + object   = {
          + apiVersion = "rabbitmq.com/v1beta1"
          + kind       = "Queue"
          + metadata   = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "webhooks.processing"
              + namespace                  = "production"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + arguments                = (known after apply)
              + autoDelete               = false
              + durable                  = true
              + name                     = "webhooks.processing"
              + rabbitmqClusterReference = {
                  + connectionSecret = {
                      + name = (known after apply)
                    }
                  + name             = "rabbitmq"
                  + namespace        = (known after apply)
                }
              + type                     = (known after apply)
              + vhost                    = (known after apply)
            }
        }
    }

  # module.s42.module.api.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/api"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.3" -> "latest"
              ~ "version"                      = "v0.22.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "api"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "v0.22.3" -> "latest"
                        # (4 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:v0.22.3" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "api"
                        # (8 unchanged attributes hidden)

                        # (16 unchanged blocks hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.api.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/api"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.3" -> "latest"
              ~ "version"                      = "v0.22.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "api"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
          ~ min_replicas                      = 1 -> 2
            # (2 unchanged attributes hidden)

            # (3 unchanged blocks hidden)
        }
    }

  # module.s42.module.api.kubernetes_service.app[0] will be updated in-place
  ~ resource "kubernetes_service" "app" {
        id                     = "production/api"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.3" -> "latest"
              ~ "version"                      = "v0.22.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "api"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.crawler_campus.kubernetes_cron_job.app[0] will be updated in-place
  ~ resource "kubernetes_cron_job" "app" {
        id = "production/crawler-campus"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.3" -> "latest"
              ~ "version"                      = "v0.22.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "crawler-campus"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (6 unchanged attributes hidden)

          ~ job_template {
              ~ metadata {
                  ~ labels      = {
                      ~ "app.kubernetes.io/version"    = "v0.22.3" -> "latest"
                      ~ "version"                      = "v0.22.3" -> "latest"
                        # (5 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (7 unchanged attributes hidden)

                  ~ template {
                      ~ metadata {
                          ~ labels      = {
                              ~ "version"                      = "v0.22.3" -> "latest"
                                # (5 unchanged elements hidden)
                            }
                            # (2 unchanged attributes hidden)
                        }

                      ~ spec {
                            # (11 unchanged attributes hidden)

                          ~ container {
                              ~ image                      = "ghcr.io/42atomys/stud42:v0.22.3" -> "ghcr.io/42atomys/stud42:latest"
                                name                       = "crawler-campus"
                                # (8 unchanged attributes hidden)

                                # (12 unchanged blocks hidden)
                            }

                            # (3 unchanged blocks hidden)
                        }
                    }
                }
            }
        }
    }

  # module.s42.module.crawler_locations.kubernetes_cron_job.app[0] will be updated in-place
  ~ resource "kubernetes_cron_job" "app" {
        id = "production/crawler-locations"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.3" -> "latest"
              ~ "version"                      = "v0.22.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "crawler-locations"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (6 unchanged attributes hidden)

          ~ job_template {
              ~ metadata {
                  ~ labels      = {
                      ~ "app.kubernetes.io/version"    = "v0.22.3" -> "latest"
                      ~ "version"                      = "v0.22.3" -> "latest"
                        # (5 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (7 unchanged attributes hidden)

                  ~ template {
                      ~ metadata {
                          ~ labels      = {
                              ~ "version"                      = "v0.22.3" -> "latest"
                                # (5 unchanged elements hidden)
                            }
                            # (2 unchanged attributes hidden)
                        }

                      ~ spec {
                            # (11 unchanged attributes hidden)

                          ~ container {
                              ~ args                       = [
                                    # (4 unchanged elements hidden)
                                    "locations",
                                  - "-c",
                                  - "53",
                                ]
                              ~ image                      = "ghcr.io/42atomys/stud42:v0.22.3" -> "ghcr.io/42atomys/stud42:latest"
                                name                       = "crawler-locations"
                                # (7 unchanged attributes hidden)

                                # (14 unchanged blocks hidden)
                            }

                            # (3 unchanged blocks hidden)
                        }
                    }
                }
            }
        }
    }

  # module.s42.module.interface.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/interface"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.3" -> "latest"
              ~ "version"                      = "v0.22.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "interface"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "v0.22.3" -> "latest"
                        # (4 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:v0.22.3" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "interface"
                        # (8 unchanged attributes hidden)

                        # (19 unchanged blocks hidden)
                    }

                    # (4 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.interface.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/interface"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.3" -> "latest"
              ~ "version"                      = "v0.22.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "interface"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
          ~ min_replicas                      = 1 -> 2
            # (2 unchanged attributes hidden)

            # (3 unchanged blocks hidden)
        }
    }

  # module.s42.module.interface.kubernetes_service.app[0] will be updated in-place
  ~ resource "kubernetes_service" "app" {
        id                     = "production/interface"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.3" -> "latest"
              ~ "version"                      = "v0.22.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "interface"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.jwtks_service.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/jwtks-service"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.3" -> "latest"
              ~ "version"                      = "v0.22.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "jwtks-service"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
          ~ replicas                  = "10" -> "1"
            # (4 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "v0.22.3" -> "latest"
                        # (4 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:v0.22.3" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "jwtks-service"
                        # (8 unchanged attributes hidden)

                      ~ env {
                          ~ name  = "DEBUG" -> "S42_SERVICE_TOKEN"
                          - value = "true" -> null

                          + value_from {

                              + secret_key_ref {
                                  + key  = "TOKEN"
                                  + name = "s42-service-token"
                                }
                            }
                        }
                      ~ env {
                          ~ name = "S42_SERVICE_TOKEN" -> "SENTRY_DSN"

                          ~ value_from {

                              ~ secret_key_ref {
                                  ~ key      = "TOKEN" -> "JWTKS_SERVICE_DSN"
                                  ~ name     = "s42-service-token" -> "sentry-dsns"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                          ~ name  = "SENTRY_DSN" -> "GO_ENV"
                          + value = "production"

                          - value_from {

                              - secret_key_ref {
                                  - key      = "JWTKS_SERVICE_DSN" -> null
                                  - name     = "sentry-dsns" -> null
                                  - optional = false -> null
                                }
                            }
                        }
                      - env {
                          - name  = "GO_ENV" -> null
                          - value = "production" -> null
                        }

                      ~ resources {
                          ~ limits   = {
                              ~ "memory" = "100Mi" -> "40Mi"
                            }
                          ~ requests = {
                              ~ "cpu"    = "100m" -> "60m"
                                # (1 unchanged element hidden)
                            }
                        }

                        # (6 unchanged blocks hidden)
                    }

                    # (5 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.jwtks_service.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/jwtks-service"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.3" -> "latest"
              ~ "version"                      = "v0.22.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "jwtks-service"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
          ~ min_replicas                      = 10 -> 2
            # (2 unchanged attributes hidden)

            # (3 unchanged blocks hidden)
        }
    }

  # module.s42.module.jwtks_service.kubernetes_manifest.certificate["grpc-internal"] will be updated in-place
  ~ resource "kubernetes_manifest" "certificate" {
      ~ manifest = {
          ~ metadata   = {
              ~ labels    = {
                  ~ "app.kubernetes.io/version"    = "v0.22.3" -> "latest"
                  ~ version                        = "v0.22.3" -> "latest"
                    # (5 unchanged elements hidden)
                }
                name      = "jwtks-service-grpc-internal"
                # (1 unchanged element hidden)
            }
            # (3 unchanged elements hidden)
        }
      ~ object   = {
          ~ metadata   = {
              ~ labels                     = {
                  - "app"                          = "jwtks-service"
                  - "app.kubernetes.io/created-by" = "github-actions"
                  - "app.kubernetes.io/managed-by" = "terraform"
                  - "app.kubernetes.io/part-of"    = "jwtks-service"
                  - "app.kubernetes.io/version"    = "v0.22.3"
                  - "kubernetes.io/name"           = "jwtks-service"
                  - "version"                      = "v0.22.3"
                } -> (known after apply)
                name                       = "jwtks-service-grpc-internal"
                # (14 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
    }

  # module.s42.module.jwtks_service.kubernetes_service.app[0] will be updated in-place
  ~ resource "kubernetes_service" "app" {
        id                     = "production/jwtks-service"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.3" -> "latest"
              ~ "version"                      = "v0.22.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "jwtks-service"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.webhooks_processor.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/webhooks-processor"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.3" -> "latest"
              ~ "version"                      = "v0.22.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "webhooks-processor"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "v0.22.3" -> "latest"
                        # (5 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:v0.22.3" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "webhooks-processor"
                        # (8 unchanged attributes hidden)

                        # (20 unchanged blocks hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.webhooks_processor.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/webhooks-processor"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.22.3" -> "latest"
              ~ "version"                      = "v0.22.3" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "webhooks-processor"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.webhooked.module.webhooked.kubernetes_config_map.app["config"] will be updated in-place
  ~ resource "kubernetes_config_map" "app" {
      ~ data        = {
          ~ "webhooks.yaml" = <<-EOT
                apiVersion: v1alpha1
                observability:
                  metricsEnabled: true
                specs:
                  - name: users-create
                    entrypointUrl: /users/create
                    security:
                      - header:
                          inputs:
                            - name: headerName
                              value: X-Secret
                      - compare:
                          inputs:
                            - name: first
                              value: "{{ .Outputs.header.value }}"
                            - name: second
                              valueFrom:
                                envRef: WEBHOOK_SECRET_HEADER
                    formatting:
                      templatePath: /config/template.tpl
                    storage:
                      - type: rabbitmq
                        specs:
                          databaseUrl:
                            valueFrom:
                              envRef: RABBITMQ_DATABASE_URL
              -           queueName: webhooks-deliveries
              +           queueName: webhooks.processing
                          contentType: application/json
                          durable: true
                  - name: users-update
                    entrypointUrl: /users/update
                    security:
                      - header:
                          inputs:
                            - name: headerName
                              value: X-Secret
                      - compare:
                          inputs:
                            - name: first
                              value: "{{ .Outputs.header.value }}"
                            - name: second
                              valueFrom:
                                envRef: WEBHOOK_SECRET_HEADER
                    formatting:
                      templatePath: /config/template.tpl
                    storage:
                      - type: rabbitmq
                        specs:
                          databaseUrl:
                            valueFrom:
                              envRef: RABBITMQ_DATABASE_URL
              -           queueName: webhooks-deliveries
              +           queueName: webhooks.processing
                          contentType: application/json
                          durable: true
                  - name: locations-create
                    entrypointUrl: /locations/create
                    security:
                      - header:
                          inputs:
                            - name: headerName
                              value: X-Secret
                      - compare:
                          inputs:
                            - name: first
                              value: "{{ .Outputs.header.value }}"
                            - name: second
                              valueFrom:
                                envRef: WEBHOOK_SECRET_HEADER
                    formatting:
                      templatePath: /config/template.tpl
                    storage:
                      - type: rabbitmq
                        specs:
                          databaseUrl:
                            valueFrom:
                              envRef: RABBITMQ_DATABASE_URL
              -           queueName: webhooks-deliveries
              +           queueName: webhooks.processing
                          contentType: application/json
                          durable: true
                  - name: locations-close
                    entrypointUrl: /locations/close
                    security:
                      - header:
                          inputs:
                            - name: headerName
                              value: X-Secret
                      - compare:
                          inputs:
                            - name: first
                              value: "{{ .Outputs.header.value }}"
                            - name: second
                              valueFrom:
                                envRef: WEBHOOK_SECRET_HEADER
                    formatting:
                      templatePath: /config/template.tpl
                    storage:
                      - type: rabbitmq
                        specs:
                          databaseUrl:
                            valueFrom:
                              envRef: RABBITMQ_DATABASE_URL
              -           queueName: webhooks-deliveries
              +           queueName: webhooks.processing
                          contentType: application/json
                          durable: true
                  - name: locations-destroy
                    entrypointUrl: /locations/destroy
                    security:
                      - header:
                          inputs:
                            - name: headerName
                              value: X-Secret
                      - compare:
                          inputs:
                            - name: first
                              value: "{{ .Outputs.header.value }}"
                            - name: second
                              valueFrom:
                                envRef: WEBHOOK_SECRET_HEADER
                    formatting:
                      templatePath: /config/template.tpl
                    storage:
                      - type: rabbitmq
                        specs:
                          databaseUrl:
                            valueFrom:
                              envRef: RABBITMQ_DATABASE_URL
              -           queueName: webhooks-deliveries
              +           queueName: webhooks.processing
                          contentType: application/json
                          durable: true
                  - name: campus-users-create
                    entrypointUrl: /campus_users/create
                    security:
                      - header:
                          inputs:
                            - name: headerName
                              value: X-Secret
                      - compare:
                          inputs:
                            - name: first
                              value: "{{ .Outputs.header.value }}"
                            - name: second
                              valueFrom:
                                envRef: WEBHOOK_SECRET_HEADER
                    formatting:
                      templatePath: /config/template.tpl
                    storage:
                      - type: rabbitmq
                        specs:
                          databaseUrl:
                            valueFrom:
                              envRef: RABBITMQ_DATABASE_URL
              -           queueName: webhooks-deliveries
              +           queueName: webhooks.processing
                          contentType: application/json
                          durable: true
                  - name: campus-users-update
                    entrypointUrl: /campus_users/update
                    security:
                      - header:
                          inputs:
                            - name: headerName
                              value: X-Secret
                      - compare:
                          inputs:
                            - name: first
                              value: "{{ .Outputs.header.value }}"
                            - name: second
                              valueFrom:
                                envRef: WEBHOOK_SECRET_HEADER
                    formatting:
                      templatePath: /config/template.tpl
                    storage:
                      - type: rabbitmq
                        specs:
                          databaseUrl:
                            valueFrom:
                              envRef: RABBITMQ_DATABASE_URL
              -           queueName: webhooks-deliveries
              +           queueName: webhooks.processing
                          contentType: application/json
                          durable: true
                  - name: campus-users-destroy
                    entrypointUrl: /campus_users/destroy
                    security:
                      - header:
                          inputs:
                            - name: headerName
                              value: X-Secret
                      - compare:
                          inputs:
                            - name: first
                              value: "{{ .Outputs.header.value }}"
                            - name: second
                              valueFrom:
                                envRef: WEBHOOK_SECRET_HEADER
                    formatting:
                      templatePath: /config/template.tpl
                    storage:
                      - type: rabbitmq
                        specs:
                          databaseUrl:
                            valueFrom:
                              envRef: RABBITMQ_DATABASE_URL
              -           queueName: webhooks-deliveries
              +           queueName: webhooks.processing
                          contentType: application/json
                          durable: true
                  - name: github-sponsorships
                    entrypointUrl: /github/sponsors
                    security:
                      - generateHmac256:
                          inputs:
                            - name: payload
                              value: "{{ .Inputs.payload }}"
                            - name: secret
                              valueFrom:
                                envRef: GITHUB_WEBHOOK_SECRET
                      - header:
                          inputs:
                            - name: headerName
                              value: X-Hub-Signature-256
                      - compare:
                          inputs:
                            - name: first
                              value: "{{ .Outputs.header.value }}"
                            - name: second
                              value: "sha256={{ .Outputs.generate_hmac_256.value }}"
                    formatting:
                      templatePath: /config/template.tpl
                    storage:
                      - type: rabbitmq
                        specs:
                          databaseUrl:
                            valueFrom:
                              envRef: RABBITMQ_DATABASE_URL
              -           queueName: webhooks-deliveries
              +           queueName: webhooks.processing
                          contentType: application/json
                          durable: true
            EOT
            # (1 unchanged element hidden)
        }
        id          = "production/webhooked-config"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.webhooked.module.webhooked.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/webhooked"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                        name                       = "webhooked"
                        # (9 unchanged attributes hidden)

                      ~ env {
                            name  = "CONFIG_MAPS_HASH"
                          ~ value = "600d9f7e19f89fed8f1e7bcef642a6aa-0b7051c94f8fe100f59c467f14678393" -> "cead1c5a9f73bd4d75ed92ed8e3385be-0b7051c94f8fe100f59c467f14678393"
                        }

                        # (14 unchanged blocks hidden)
                    }

                    # (3 unchanged blocks hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 17 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: apps-tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "apps-tfplan"

```
</details>